### Import packages

In [1]:
import sqlite3
import pandas as pd

### Connect to database - there are two relevant tables ('author' and 'books')

In [2]:
conn = sqlite3.connect('amazon_db.db')
c = conn.cursor()

In [3]:
c.execute("""SELECT * FROM books
LIMIT 5; """)

In [4]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                                books num_copies
0         A Elephant Ate Under A Fish    4226324
1         A Boy Jumped Outside A Lake    4048899
2       One Man Hopped Under The Tree     774329
3  A Person Threw Behind The Notebook    1359606
4     The Tree Ran Through A Mountain    4703380

In [5]:
c.execute("""SELECT * FROM author
LIMIT 5; """);

In [6]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

             author                                book
0      David Taylor         A Guy Dove Outside The Desk
1    Sidney Osborne        A Fish Hopped Through A Lake
2     Robert Martin     The Woman Winced Outside A Desk
3      Greg Simpson  A Banana Winced Outside The Banana
4  Edgar Williamson      A Person Ate Behind The Potato

### Use SQL to answer the following questions:

1. How many rows are in the 'author' table? 

2. How many authors have the first name 'David'?  

3. How many books did each author write? 

4. Use both the author table and books table to answer: how many copies were sold by authors named David 


    a. how many copies for each of the Davids
    
    
    b. how many copies in total for all Davids

In [7]:
# How many rows are in the 'author' table?
c.execute("""SELECT COUNT(author)
            FROM author """).fetchall()

[(100000,)]

In [9]:
# How many authors have the first name 'David'?
c.execute("""SELECT COUNT(author)
            FROM author 
            WHERE author LIKE 'David%'""").fetchall()

[(1335,)]

In [20]:
# How many books did each author write?
c.execute("""SELECT author, COUNT(book)
            FROM author 
            GROUP BY author
            ORDER BY COUNT(book)
            DESC
            """)
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

            author  COUNT(book)
0  Robert Williams           25
1      James Smith           24
2    William Smith           22
3   Robert Johnson           21
4    Mary Williams           19

In [30]:
# Use both the author table and books table to answer: how many copies were sold by authors named David
# a. how many copies for each of the Davids
c.execute("""SELECT author, SUM(num_copies)
            FROM author 
            JOIN books 
            on author.book = books.books
            WHERE author LIKE 'David%'
            GROUP BY author""")
df2 = pd.DataFrame(c.fetchall())
df2.columns = [x[0] for x in c.description]
display(df2.head())
# b. how many copies in total for all Davids
c.execute("""SELECT author, SUM(num_copies)
            FROM author 
            JOIN books 
            on author.book = books.books
            WHERE author LIKE 'David%'""")
df3 = pd.DataFrame(c.fetchall())
df3.columns = [x[0] for x in c.description]
df3.head()

           author  SUM(num_copies)
0    David Abbott           828701
1    David Aberle          3376038
2  David Abramson           696103
3   David Acevedo          1211907
4     David Adams          4804120

         author  SUM(num_copies)
0  David Taylor       2611352486